# 교통수단(버스, 지하철) 최종 테이블

In [1]:
import pandas as pd

In [3]:
# 전처리된 데이터 불러오기
bus = pd.read_excel('/Users/nabong/Desktop/project_login/data/cleaned/버스정류장_위치통계_최종.xlsx')
subway = pd.read_excel('/Users/nabong/Desktop/project_login/data/cleaned/지하철_위치통계_최종.xlsx')

In [6]:
df = pd.concat([bus, subway]).reset_index(drop=True)
print(bus.shape, subway.shape, df.shape)
df

(11135, 7) (393, 7) (11528, 7)

,node_id,정류소명(역명),월평균승차수,월평균하차수,월평균승하차총계,위도,경도
0,B100000001,종로2가사거리,14645.0,13676.0,28321.0,37.569765,126.987750
1,B100000002,창경궁.서울대학교병원,81002.0,70081.0,151083.0,37.579183,126.996566
2,B100000003,명륜3가.성대입구,134621.0,92019.0,226640.0,37.582671,126.998340
3,B100000004,종로2가.삼일교,19992.0,23697.0,43689.0,37.568579,126.987613
4,B100000005,혜화동로터리.여운형활동터,50309.0,77328.0,127637.0,37.586243,127.001744
...,...,...,...,...,...,...,...
11523,S1005,대방,NaN,NaN,NaN,37.513342,126.926382
11524,S1004,노량진,NaN,NaN,NaN,37.514149,126.942710
11525,S1003,용산,NaN,NaN,NaN,37.529849,126.964561
11526,S1002,남영,NaN,NaN,NaN,37.541021,126.971300
11527,S1001,서울역,NaN,NaN,NaN,37.554337,126.971134

In [35]:
bus.to_excel('bus_info.xlsx', index=False)
subway.to_excel('subway_info.xlsx', index=False)

In [33]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 11528 entries, 0 to 11527
Data columns (total 7 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   node_id   11528 non-null  object
 1   정류소명(역명)  11528 non-null  object
 2   월평균승차수    10857 non-null  float64
 3   월평균하차수    10857 non-null  float64
 4   월평균승하차총계  10857 non-null  float64
 5   위도        11528 non-null  float64
 6   경도        11528 non-null  float64
dtypes: float64(5), object(2)
memory usage: 630.6+ KB

In [34]:
df.to_excel('transport_info.xlsx', index=False)

In [4]:
# 버스 정류장 데이터
bus.info()
bus.head(2)

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 11226 entries, 0 to 11225
Data columns (total 7 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   node_id   11226 non-null  object
 1   정류소명(역명)  11226 non-null  object
 2   월평균승차수    10626 non-null  float64
 3   월평균하차수    10626 non-null  float64
 4   월평균승하차총계  10626 non-null  float64
 5   위도        11226 non-null  float64
 6   경도        11226 non-null  float64
dtypes: float64(5), object(2)
memory usage: 614.0+ KB

      node_id     정류소명(역명)   월평균승차수   월평균하차수  월평균승하차총계         위도          경도
0  B100000001      종로2가사거리  14645.0  13676.0   28321.0  37.569765  126.987750
1  B100000002  창경궁.서울대학교병원  81002.0  70081.0  151083.0  37.579183  126.996566

In [22]:
# 지하철 데이터
subway.info()
subway.head(2)

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 401 entries, 0 to 400
Data columns (total 7 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   node_id   401 non-null    object
 1   정류소명(역명)  401 non-null    object
 2   월평균승차수    260 non-null    float64
 3   월평균하차수    260 non-null    float64
 4   월평균승하차총계  260 non-null    float64
 5   위도        401 non-null    float64
 6   경도        401 non-null    float64
dtypes: float64(5), object(2)
memory usage: 22.1+ KB

  node_id 정류소명(역명)     월평균승차수      월평균하차수    월평균승하차총계         위도          경도
0    S150      서울역  1301736.5  1264329.75  2566066.25  37.556228  126.972135
1    S151       시청   625330.5   632575.33  1257905.83  37.565715  126.977088

In [17]:
# 데이터 합치기
df = pd.concat([bus, subway]).reset_index(drop=True)
print(bus.shape, subway.shape, df.shape)
df.tail(2)

(11226, 7) (401, 7) (11627, 7)

      node_id 정류소명(역명)  월평균승차수  월평균하차수  월평균승하차총계         위도          경도
11625   S1002       남영     NaN     NaN       NaN  37.541021  126.971300
11626   S1001      서울역     NaN     NaN       NaN  37.554337  126.971134

In [9]:
pd.options.display.float_format = '{:.2f}'.format
df.describe()

          월평균승차수     월평균하차수   월평균승하차총계       위도       경도
count   10857.00   10857.00   10857.00 11528.00 11528.00
mean    22443.50   22185.35   44628.84    37.55   126.99
std     86506.56   86599.23  172441.79     0.05     0.09
min         0.00       0.00       0.00    37.43   126.77
25%      1364.00    1759.00    4165.00    37.50   126.92
50%      5027.00    5628.00   11537.00    37.55   127.00
75%     15227.00   14876.00   30356.00    37.59   127.05
max   2183611.92 2141427.75 4325039.67    37.69   127.18

In [10]:
df[df['node_id'].str.contains('B')]

          node_id       정류소명(역명)    월평균승차수   월평균하차수  월평균승하차총계    위도     경도
0      B100000001        종로2가사거리  14645.00 13676.00  28321.00 37.57 126.99
1      B100000002    창경궁.서울대학교병원  81002.00 70081.00 151083.00 37.58 127.00
2      B100000003      명륜3가.성대입구 134621.00 92019.00 226640.00 37.58 127.00
3      B100000004       종로2가.삼일교  19992.00 23697.00  43689.00 37.57 126.99
4      B100000005  혜화동로터리.여운형활동터  50309.00 77328.00 127637.00 37.59 127.00
...           ...            ...       ...      ...       ...   ...    ...
11130  B124000334          우성아파트       NaN      NaN       NaN 37.55 127.14
11131  B124000333          우성아파트       NaN      NaN       NaN 37.55 127.14
11132  B124000332           조일약국       NaN      NaN       NaN 37.53 127.12
11133  B124000331           성내시장       NaN      NaN       NaN 37.54 127.13
11134  B124000330    천호우체국.로데오거리       NaN      NaN       NaN 37.54 127.13

[11135 rows x 7 columns]

In [ ]:
df.to_excel('/Users/nabong/Desktop/project_login/data/cleaned/교통_위치통계_최종.xlsx', index=False)